const API_DOMAIN = "https://www.310game.com"; // 接口请求域名
const IMG_DOMAIN = "https://cdn3.ibingniao.com/"; // 图片域名

//宠物介绍图片-gif
const bulletScreen = [
  ['屁颠屁颠跟着好可爱','这是超级网红鸭','绝技是吃光地图里的草让敌人无草可吃','现在头上都爱带点绿吗','用可爱一战到底吧'],
  ['又美又可爱的才叫宠物','能带我下去海底逛逛吗？','想吃海鲜大餐...','翻起千层浪，划船不用桨','怎么就没有深海恐惧症呢'],
  ['蹭蹭会刮下来几层皮吧','牛不可貌相','留给我看家可以吗','明明超凶的','还附赠了一个遥控'],
  ['为什么不穿裤子','彩色斗篷好拉风','感觉眼睛下一秒就要发射激光','真.杀敌于无形','让我看看你的真身'],
  ['秃...秃顶','来自程序猿内心的怒吼','平时可以用来烧烤呗','丑萌丑萌的','不小心碰到啊烫烫烫'],
  ['小翅膀还是可爱的...','我好怕怕...','是完美的倒三角','这么紫是中毒了咩','只是看着它就hin紧张'],
  ['快到碗里来','一把年纪还能战斗点个赞','老公公救救孩子','脑海中唱起了圣诞歌','大概是慈祥感化了敌人'],
  ['手贱白了个度，诶我去。。。','我原来还以为就是嫦娥小姐姐的兔子而已','兄弟，借一部说话','我有必要申明一下我用这个宠物的原因','因车思婷 (=´ω｀=)'],
  ['你可以召唤其他的小骷髅吗？','举手！骷髅为什么穿衣服','因为盆骨不好画啊，真的','你走吧，你显然不是我的对手','你有小**吗'],
  ['总感觉有一双眼睛在盯着我','真让人头大','下单了逗猫棒','你的脸有这么大','主角身边都有一只黑猫没错就是我'],
  ['一点也不恐怖哦','这是装木乃伊壮胆吗','莫名觉得很可爱啊','冲啊，风~咻咻咻咻','没关系我来保护你吧'],
  ['此地无银三百两','真的没有宝藏，藏宝图是小孩子画着玩的','我为什么在这里？你管得着吗','别！别动手','动手不要打脸'],
  ['带上他，我无人可挡','可是表情莫名的喜感','选我选我选我','严肃一点好吗，我是目前最屌的宠物没有之一','点一下自动战斗就可以了，傻X']
];
const PET_INTRD = {
  num: 13,
  petGif: 'https://bingniao-cdn3.oss-cn-shenzhen.aliyuncs.com/cms/yhphs/pet-intro/pet/',
  petGifs: new Array(13).fill('1'),
  petDec: './static/localImg/pet/pet-des/',
  petIcon: './static/localImg/pet/pet-icon/',
  pets: [
    {
      name: '草泥马',
      text: ['屁颠屁颠跟着好可爱','这是超级网红鸭','绝技是吃光地图里的草让敌人无草可吃','现在头上都爱带点绿吗','用可爱一战到底吧']
    },
    {
      name: '美人鱼',
      text: ['又美又可爱的才叫宠物','能带我下去海底逛逛吗？','想吃海鲜大餐...','翻起千层浪，划船不用桨','怎么就没有深海恐惧症呢']
    },
    {
      name: '机器牛',
      text: ['蹭蹭会刮下来几层皮吧','牛不可貌相','留给我看家可以吗','明明超凶的','还附赠了一个遥控']
    },
    {
      name: '魔术师',
      text: ['为什么不穿裤子','彩色斗篷好拉风','感觉眼睛下一秒就要发射激光','真.杀敌于无形','让我看看你的真身']
    },
    {
      name: '熔岩山岭',
      text: ['秃...秃顶','来自程序猿内心的怒吼','平时可以用来烧烤呗','丑萌丑萌的','不小心碰到啊烫烫烫']
    },
    {
      name: '萨特',
      text: ['小翅膀还是可爱的...','我好怕怕...','是完美的倒三角','这么紫是中毒了咩','只是看着它就hin紧张']
    },
    {
      name: '圣诞老人',
      text: ['快到碗里来','一把年纪还能战斗点个赞','老公公救救孩子','脑海中唱起了圣诞歌','大概是慈祥感化了敌人'],
    },
    {
      name: '兔儿神',
      text: ['手贱白了个度，诶我去。。。','我原来还以为就是嫦娥小姐姐的兔子而已','兄弟，借一部说话','我有必要申明一下我用这个宠物的原因','因车思婷 (=´ω｀=)']
    },
    {
      name: '小骷髅',
      text: ['你可以召唤其他的小骷髅吗？','举手！骷髅为什么穿衣服','因为盆骨不好画啊，真的','你走吧，你显然不是我的对手','你有小**吗'],
    },
    {
      name: '小黑猫',
      text: ['总感觉有一双眼睛在盯着我','真让人头大','下单了逗猫棒','你的脸有这么大','主角身边都有一只黑猫没错就是我']
    },
    {
      name: '羞涩之风',
      text: ['一点也不恐怖哦','这是装木乃伊壮胆吗','莫名觉得很可爱啊','冲啊，风~咻咻咻咻','没关系我来保护你吧']
    },
    {
      name: '影魔',
      text: ['此地无银三百两','真的没有宝藏，藏宝图是小孩子画着玩的','我为什么在这里？你管得着吗','别！别动手','动手不要打脸']
    },
    {
      name: '元素之主',
      text: ['带上他，我无人可挡','可是表情莫名的喜感','选我选我选我','严肃一点好吗，我是目前最屌的宠物没有之一','点一下自动战斗就可以了，傻X']
    },
  ]
}

export {
  API_DOMAIN,
  IMG_DOMAIN,
  PET_INTRD
};
